In [1]:
import pandas as pd

In [2]:
pwd

u'/Users/DRN/capstone/jupyternotebooks'

In [3]:
salaries_2015 = pd.read_csv('../data/salaries/salaries_2015.csv', index_col=0)

In [4]:
salaries_2015.head()

,Name,Team,POS,Salary,Years,Total Value,Avg Annual
0,Justin Verlander,DET,SP,"$28,000,000",7 (2013-19),"$180,000,000","$25,714,285"
1,Zack Greinke,LAD,SP,"$27,000,000",6 (2013-18),"$147,000,000","$24,500,000"
2,Josh Hamilton,LAA,RF,"$25,000,000",5 (2013-17),"$125,000,000","$25,000,000"
3,Ryan Howard,PHI,1B,"$25,000,000",5 (2012-16),"$125,000,000","$25,000,000"
4,Cliff Lee,PHI,SP,"$25,000,000",5 (2011-15),"$120,000,000","$24,000,000"

In [5]:
salaries_2015.rename(columns={'Team': 'team', 'Name': 'name', 'POS': 'pos', 'Salary': 'salary', 'Years': 'years',
                         'Total Value': 'total_value', 'Avg Annual': 'avg_annual'},
                         inplace=True)

In [6]:
salaries_2015.head()

,name,team,pos,salary,years,total_value,avg_annual
0,Justin Verlander,DET,SP,"$28,000,000",7 (2013-19),"$180,000,000","$25,714,285"
1,Zack Greinke,LAD,SP,"$27,000,000",6 (2013-18),"$147,000,000","$24,500,000"
2,Josh Hamilton,LAA,RF,"$25,000,000",5 (2013-17),"$125,000,000","$25,000,000"
3,Ryan Howard,PHI,1B,"$25,000,000",5 (2012-16),"$125,000,000","$25,000,000"
4,Cliff Lee,PHI,SP,"$25,000,000",5 (2011-15),"$120,000,000","$24,000,000"

In [7]:
salaries_2015.team.value_counts()

OAK    32
TEX    32
PIT    30
ARI    30
LAD    30
PHI    30
ATL    30
BOS    30
TB     30
WSH    29
BAL    29
COL    29
SD     29
NYY    29
LAA    29
CHC    28
SF     28
KC     28
HOU    28
NYM    28
CHW    28
CIN    27
MIA    27
CLE    27
STL    27
TOR    26
MIN    26
MIL    26
SEA    26
DET    25
Name: team, dtype: int64

In [8]:
salaries_2015.replace({'team' : {'SF': 'SFG', 'SD': 'SDP', 'TB': 'TBR', 'KC': 'KCR'}}, inplace=True)

In [9]:
salaries_2015.team.value_counts()

TEX    32
OAK    32
PIT    30
ARI    30
TBR    30
LAD    30
ATL    30
PHI    30
BOS    30
WSH    29
BAL    29
COL    29
NYY    29
LAA    29
SDP    29
CHC    28
NYM    28
CHW    28
SFG    28
HOU    28
KCR    28
MIA    27
CLE    27
STL    27
CIN    27
SEA    26
TOR    26
MIN    26
MIL    26
DET    25
Name: team, dtype: int64

In [10]:
salaries_2015.dtypes

name           object
team           object
pos            object
salary         object
years          object
total_value    object
avg_annual     object
dtype: object

In [11]:
salaries_2015.head()

,name,team,pos,salary,years,total_value,avg_annual
0,Justin Verlander,DET,SP,"$28,000,000",7 (2013-19),"$180,000,000","$25,714,285"
1,Zack Greinke,LAD,SP,"$27,000,000",6 (2013-18),"$147,000,000","$24,500,000"
2,Josh Hamilton,LAA,RF,"$25,000,000",5 (2013-17),"$125,000,000","$25,000,000"
3,Ryan Howard,PHI,1B,"$25,000,000",5 (2012-16),"$125,000,000","$25,000,000"
4,Cliff Lee,PHI,SP,"$25,000,000",5 (2011-15),"$120,000,000","$24,000,000"

In [12]:
salaries_2015.salary = salaries_2015.salary.str.replace('$','')
salaries_2015.salary = salaries_2015.salary.str.replace(',','')
salaries_2015.total_value = salaries_2015.total_value.str.replace('$','')
salaries_2015.total_value = salaries_2015.total_value.str.replace(',','')
salaries_2015.avg_annual = salaries_2015.avg_annual.str.replace('$','')
salaries_2015.avg_annual = salaries_2015.avg_annual.str.replace(',','')

In [13]:
salaries_2015 = salaries_2015.drop('years', 1)

In [14]:
salaries_2015.head()

               name team pos     salary total_value avg_annual
0  Justin Verlander  DET  SP  28000000   180000000   25714285
1      Zack Greinke  LAD  SP  27000000   147000000   24500000
2     Josh Hamilton  LAA  RF  25000000   125000000   25000000
3       Ryan Howard  PHI  1B  25000000   125000000   25000000
4         Cliff Lee  PHI  SP  25000000   120000000   24000000

In [15]:
salaries_2015['salary'] = salaries_2015.salary.astype(float)
salaries_2015['total_value'] = salaries_2015.total_value.astype(float)
salaries_2015['avg_annual'] = salaries_2015.avg_annual.astype(float)

In [16]:
salaries_2015.head()

               name team pos      salary  total_value  avg_annual
0  Justin Verlander  DET  SP  28000000.0  180000000.0  25714285.0
1      Zack Greinke  LAD  SP  27000000.0  147000000.0  24500000.0
2     Josh Hamilton  LAA  RF  25000000.0  125000000.0  25000000.0
3       Ryan Howard  PHI  1B  25000000.0  125000000.0  25000000.0
4         Cliff Lee  PHI  SP  25000000.0  120000000.0  24000000.0

In [17]:
salaries_2015.to_csv('salaries_2015.csv', sep='\t', encoding='utf-8')